resources/receipt-templates/epson/sales-receipt.xml

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
<feed line="1"/>
<logo key1="34" key2="48"/>
<text lang="en"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>{{store_name}}</text>
<feed/>
<text reverse="false" ul="false" em="false" color="color_1"/>
<text>Org.nr.: {{organization_number}} MVA</text>
{{#store_address}}
<feed/>
<text lang="en"/>
<text>{{store_address}}</text>
{{/store_address}}
<feed line="2"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>SALGSKVITTERING</text>
<feed line="1"/>
<text lang="en"/>
<text reverse="false" ul="false" em="false" color="color_1"/>
<text>Kasse-ID: {{session_number}}   Ansatt: {{cashier_name}}</text>
<feed/>
<text lang="en"/>
<text>Transaksjons-ID: {{transaction_id}}</text>
<feed/>
<text lang="en"/>
<text>Dato: {{date_time}}</text>
<feed/>
<text>—————————————————————————————————————————————</text>
<feed/>
<feed/>
{{#items}}
{{#formatted_line}}
<text>{{formatted_line}}</text>
{{/formatted_line}}
{{^formatted_line}}
<text>{{name}}        {{quantity}} x {{unit_price}}</text>
{{/formatted_line}}
{{#description_line}}
<feed/>
<text>{{description_line}}</text>
{{/description_line}}
<feed/>
<text lang="en"/>
{{/items}}
<text lang="en"/>
<text>—————————————————————————————————————————————</text>
<feed/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>Total                         {{total_amount}} NOK</text>
<feed/>
<text>—————————————————————————————————————————————</text>
<feed/>
<text lang="en"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>MVA-sats(Grunnlag)                     MVA</text>
<feed/>
<text>{{vat_rate}}%({{vat_base}})                        {{vat_amount}}</text>
<feed/>
<feed/>
<text>Betalingsmiddel: {{payment_method_display}}</text>
<feed/>
<text>Totalbeløp: NOK {{total_amount}}</text>
<feed line="2"/>
<barcode type="code128_auto" hri="none" font="font_a" width="2" height="40">{{receipt_number}}</barcode>
<feed/>
<text>—————————————————————————————————————————————</text>
<text lang="en"/>
<feed/>
<text>Kontakt butikken ved spørsmål om retur</text>
<feed/>
<text>og reklamasjon. Ta med kvittering.</text>
<feed/>
<feed/>
<cut type="feed"/>
</epos-print></s:Body></s:Envelope>
